Repository: mimosa67/bootsetup
Catalog: data/po/*.po
Languages: fr

source: About BootSetup
fr: À propos de BootSetup

source: Helps set up a bootloader like LiLo or Grub2.
fr: Aide à installer un chargeur de démarrage tel LiLo ou Grub2.

source: translator_name <translator@email.com>
fr: Cyrille Pontvieux <jrd@enialis.net>

source: Install bootloader on:
fr: Installer le chargeur de démarrage sur :

source: File system
fr: Système de fichiers

source: Operating system
fr: Système d'exploitation

source: Boot menu label
fr: Étiquette du menu

source: _Undo configuration
fr: _Annuler la configuration

source: _Edit configuration
fr: _Modifier la configuration

source: Install Grub2 files on:
fr: Installer les fichiers de Grub2 sur :

source: _Install bootloader
fr: _Installer le gestionnaire de démarrage

source: Unrecognized parameter '{0}'.
fr: Paramètre '{0}' non-reconnu.

source: bootloader parameter should be lilo, grub2 or '_', given {0}.
fr: Le paramètre du bootloader doit être lilo, grub2 ou '_', {0} a été saisi.

source: Partition {0} not found.
fr: Partition {0} non trouvée.

source: Root privileges are required to run this program.
fr: Les droits d'administrateur (Root) sont requis pour exécuter ce programme.

source: Sorry!
fr: Désolé !

source: ERROR
fr: ERREUR

source: Help
fr: Aide

source: About
fr: À propos

source: Quit
fr: Quitter

source: <b>BootSetup will install a new bootloader on your computer.</b> A bootloader is required to load the main operating system of a computer and will initially display a boot menu if several operating systems are available on the same computer.
fr: <b>BootSetup installera un nouveau gestionnaire de démarrage sur votre ordinateur.</b> Un gestionnaire de démarrage est indispensable pour charger le système d'exploitation d'un ordinateur. Au démarrage, Il affichera un menu si plusieurs systèmes d'exploitation différents sont disponibles sur votre machine.

source: Bootloader:
fr: Chargeur de démarrage :

source: Close
fr: Fermer

source: Select the device that will contain your bootloader. This is commonly the device you set your Bios to boot on.
fr: Sélectionnez le disque qui contiendra votre chargeur de démarrage. C'est en général le disque sur lequel votre Bios démarre.

source: Here you must define a boot menu label for each of the operating systems that will be displayed in your bootloader menu. Any partition for which you do not set a boot menu label will not be configured and will not be displayed in the bootloader menu. If several kernels are available within one partition, the label you have chosen for that partition will be appended numerically to create multiple menu entries for each of these kernels. Any of these settings can be edited manually in the configuration file.
fr: Ce tableau vous permet de définir un intitulé pour chacun des systèmes d'exploitation qui seront affichés dans le menu de votre gestionnaire de démarrage. Toute partition pour laquelle vous n'aurez défini aucun intitulé ne sera pas configurée et ne sera pas affichée dans le gestionnaire de menu. Si plusieurs noyaux sont disponibles pour un même système d'exploitation, un suffixe numéral sera ajouté à l'intitulé que vous avez défini, permettant ainsi de créer de multiples intitulés dans le menu pour chacun des noyaux. Chacun de ces paramètres peut être modifié manuellement dans le fichier de configuration.

source: Use this arrow if you want to move the selected Operating System up to a higher rank. The partition with the highest rank will be displayed on the first line of the bootloader menu. Any of these settings can be edited manually in the configuration file.
fr: Veuillez cliquer sur cette flèche si vous désirez déplacer le système d'exploitation sélectionné vers le haut de la liste. La partition située tout en haut de la liste sera affichée sur la première ligne du menu du gestionnaire de démarrage. Chacun de ces paramètres peut être modifié manuellement dans le fichier de configuration.

source: Use this arrow if you want to move the selected Operating System down to a lower rank. The partition with the lowest rank will be displayed on the last line of the bootloader menu. Any of these settings can be edited manually in the configuration file.
fr: Veuillez cliquer sur cette flèche si vous désirez déplacer le système d'exploitation sélectionné vers le bas de la liste. La partition située tout en bas de la liste sera affichée sur la dernière ligne du menu du gestionnaire de démarrage. Chacun de ces paramètres peut être modifié manuellement dans le fichier de configuration.

source: Experienced users can manually edit the LiLo configuration file. Please do not tamper with this file unless you know what you are doing and you have read its commented instructions regarding chrooted paths.
fr: Les utilisateurs expérimentés ont la possibilité de modifier le fichier de configuration de LiLo manuellement (paramètres identiques à lilo.conf). Cette option est utilisable à vos propres risques… Veuillez ne pas modifier ce fichier si vous n'êtes pas sûr de savoir quoi faire et sans y lire les instructions 'commentées' au sujet des chemins d'accès de la partition 'chrootée'.

source: This will undo all settings (even manual modifications).
fr: Cette action annulera tout le paramétrage (même vos modifications manuelles).

source: Select the partition that will contain the Grub2 files. These will be in /boot/grub/. This partition should be readable by Grub2. It is recommanded to use your / partition, or your /boot partition if you have one.
fr: Sélectionnez la partition qui contiendra les fichiers de Grub2. Ils se placeront dans /boot/grub/. Cette partition doit être lisible par Grub2. Il est recommandé d'utiliser votre partition /, ou votre partition /boot si vous en avez une.

source: You can edit the etc/default/grub file for adjusting the Grub2 settings. This will not let you choose the label or the order of the menu entries, it's automatically done by Grub2.
fr: Vous pouvez éditer le fichier etc/default/grub pour ajuster les paramètres de Grub2. Cela ne vous permettra pas de choisir l'étiquette ou l'ordre des entrées du menu, ceci est automatiquement réalisé par Grub2.

source: Once you have defined your settings, click on this button to install your bootloader.
fr: Après avoir défini vos paramètres, veuillez cliquer sur ce bouton afin de démarrer l'installation de votre chargeur de démarrage.

source: An Operating System label should not contain spaces. Please verify and correct.
fr: L'intitulé d'un système d'exploitation ne doit contenir aucun espace. Veuillez vérifier et corriger.

source: An Operating System label should not hold more than {max} characters. Please verify and correct.
fr: L'intitulé d'un système d'exploitation ne doit pas contenir plus de {max} caractères. Veuillez vérifier et corriger.

source: Sorry, BootSetup is unable to find a Linux filesystem on your choosen boot entries, so cannot install LiLo.
fr: Désolé, BootSetup n'a pas trouvé de système de fichiers Linux parmi vos entrées de démarrage, et ne peut donc installer LiLo.

source: Sorry, BootSetup is unable to find a suitable text editor in your system. You will not be able to manually modify the LiLo configuration.
fr: Désolé, BootSetup n'a pas trouvé d'éditeur de texte adéquat dans votre système. Il vous sera impossible de modifier la configuration de Lilo manuellement.

source: Sorry, BootSetup is unable to find a suitable text editor in your system. You will not be able to manually modify the Grub2 default configuration.
fr: Désolé, BootSetup n'a pas trouvé d'éditeur de texte adéquat dans votre système. Il vous sera impossible de modifier la configuration par défaut de Grub2 manuellement.

source: Bootloader installation process completed.
fr: Installation du chargeur de démarrage terminée.

source: About BootSetup.
fr: À propos de BootSetup.

source: Exit BootSetup program.
fr: Quitter le programme BootSetup.

source: Set...
fr: Définir...

source: You have used the same label for different Operating Systems. Please verify and correct.
fr: Vous avez utilisé le même intitulé pour plusieurs systèmes d'exploitation différents. Veuillez vérifier et corriger.

source: Cancel
fr: Annuler

source: Install a bootloader, LiLo or Grub2
fr: Installer un chargeur de démarrage, LiLo ou Grub2
